perf/stressTesting/ping.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api/ping'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warm Up
      duration: 30
      arrivalRate: 5
      rampTo: 15
    - name: Plain load
      duration: 60
      arrivalRate: 15
      rampTo: 100
    - name: Plain load 2
      duration: 60
      arrivalRate: 100
      rampTo: 200
    - name: Plain load 3
      duration: 60
      arrivalRate: 200
    - name: Cool Down
      duration: 30
      arrivalRate: 20
      rampTo: 1

scenarios:
  - name: StressPing (/)
    flow:
      - get:
          url: '/'